# value=input("Введите целое число:")
# print(value)
# result=int(value)*2
# print(result)

########################################################################################################################

# value=input("Введите число с точкой:")
# print(value)
# result=float(value)*2
# print(result)

########################################################################################################################
value=input("Введите свое имя:")
print(value)
result=str(value)*2
print(result)